Tekla.Structures.Model.ModelHandler
The ModelHandler class provides information about the currently open Tekla Structures
model.
The following example opens the model that is in the C:\teklastructuresmodels\NewModel17 folder
and shows a message if the opening was successful.
using Tekla.Structures.Model;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
ModelHandler handler = new ModelHandler();
if (handler.IsModelSaved())
{
if (handler.Open("C:\\teklastructuresmodels\\NewModel17"))
MessageBox.Show("The model opened successfully.");
}
else
MessageBox.Show("The current model is not saved.");
}
}

Tekla.Structures.Model.ModelHandler.#ctor
Creates a new ModelHandler instance.

Tekla.Structures.Model.ModelHandler.CreateNewSingleUserModel(System.String,System.String,System.String)
Creates a new single user model.
Current model is not saved in the operation.
ModelName: The name for the new model.
ModelFolder: The folder path for the new model.
TemplateNameOrTemplatePath: The optional template name for the new model.
Returns: True on success.

Tekla.Structures.Model.ModelHandler.CreateNewMultiUserModel(System.String,System.String,System.String)
Creates a new multi-user model.
Current model is not saved in the operation.
ModelName: The name for the new model.
ModelFolder: The folder path for the new model.
ServerName: The multi user server name.
Returns: True on success.

Tekla.Structures.Model.ModelHandler.Save(System.String,System.String)
Saves current model with comment and user information.
Comment: The comment for save operation, used only with multi-user models.
User: The user identification, used only with multi-user models.
Returns: True on success.

Tekla.Structures.Model.ModelHandler.Save(System.String,System.String,System.String)
Saves current model with comment and user information.
Comment: The comment for save operation, used only with multi-user models.
User: The user identification, used only with multi-user models.
Reason: The reason why this model save is being called. Used for identifying model save events.
Returns: True on success.

Tekla.Structures.Model.ModelHandler.Open(System.String,System.Boolean)
Opens a new model to Tekla Structures without saving changes to current model.
ModelFolder: The model folder path to be used.
OpenAutoSaved: Tells whether to open auto saved information or not. Optional parameter, default = false
Returns: True on success.

Tekla.Structures.Model.ModelHandler.Close
Closes current model.

Tekla.Structures.Model.ModelHandler.IsModelSaved
Tells whether current model has been saved.
Returns: True if there are no unsaved changes in the model.

Tekla.Structures.Model.ModelHandler.IsModelAutoSaved(System.String)
Tells whether a model has auto saved information.
ModelFolder: The model folder path to be used.
Returns: True if there is auto saved information.